2412/tutorials/incompressible/simpleFoam/rotorDisk/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

domain
{
    xMin      -1.26;
    xMax       1.26;
    yMin      -2.01;
    yMax       2.01;
    zMin      -1.26;
    zMax       1.26;
    xCells    12;
    yCells    22;
    zCells    12;
}

scale   1;

vertices
(
    ($/domain/xMin $/domain/yMin $/domain/zMin)
    ($/domain/xMax $/domain/yMin $/domain/zMin)
    ($/domain/xMax $/domain/yMax $/domain/zMin)
    ($/domain/xMin $/domain/yMax $/domain/zMin)

    ($/domain/xMin $/domain/yMin $/domain/zMax)
    ($/domain/xMax $/domain/yMin $/domain/zMax)
    ($/domain/xMax $/domain/yMax $/domain/zMax)
    ($/domain/xMin $/domain/yMax $/domain/zMax)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (
        $/domain/xCells
        $/domain/yCells
        $/domain/zCells
    )
    simpleGrading (1 1 1)
);

edges
(
);

boundary
(
);

mergePatchPairs
(
);


// Cleanup
#remove ( domain )

// ************************************************************************* //
